/*************************************************************************
*  Copyright (C) 2004 by Janek Kozicki                                   *
*  cosurgi@berlios.de                                                    *
*                                                                        *
*  This program is free software; it is licensed under the terms of the  *
*  GNU General Public License v2 or later. See file LICENSE for details. *
*************************************************************************/

#pragma once


#include "Indexable.hpp"


#include<yade/lib-factory/ClassFactory.hpp>
#include<yade/lib-serialization/Serializable.hpp>
#include<yade/lib-multimethods/MultiMethodsExceptions.hpp>
#include<yade/lib-loki/Functor.hpp>
#include<yade/lib-loki/Typelist.hpp>
#include<yade/lib-loki/TypeManip.hpp>
#include<yade/lib-loki/NullType.hpp>


#include <vector>
#include <list>
#include <string>


using namespace std;
using namespace boost;


///
/// base classes involved in multiple dispatch must be derived from Indexable
///

/// base template for all dispatchers								///

template 
<
	class BaseClass,	//	a typelist with base classess involved in the dispatch (or single class, for 1D )
				// 		FIXME : should use shared_ptr references, like this: DynLibDispatcher< TYPELIST_2( shared_ptr<PhysicalAction>& , shared_ptr<Body>& ) , ....
	class Executor,		//	class which gives multivirtual function
	class ResultType,	//	type returned by multivirtual function
	class TList,		//	typelist of arguments passed to multivirtual function
				//	WARNING: first arguments must be shared_ptr<BaseClass>, for details see FunctorWrapper
				
	bool autoSymmetry=true	//	true -	the function called is always the same,
				//		only order of arguments is rearranged
				//		to make correct function call, 
				//		only go() is called
				//		
				//	false -	the function called is always different.
				//		arguments order is not rearranged
				//		go(), and goReverse() are called, respectively
				//
>
class DynLibDispatcher
{

		// this template recursively defines a type for callBacks matrix, with required number of dimensions
	private : template<class T > struct Matrix
		  {
			typedef Loki::NullType ResultIterator;
			typedef Loki::NullType ResultIteratorInt;
		  };

	private : template<class Head > struct Matrix< Loki::Typelist< Head, Loki::NullType > >
		  {
			typedef vector< shared_ptr< Executor > > 			Result;
			typedef vector< int > 						ResultInt;
			typedef typename vector< shared_ptr< Executor > >::iterator 	ResultIterator;
			typedef vector< int >::iterator 				ResultIteratorInt;
		  };

	private : template<class Head, class Tail >
		  struct Matrix< Loki::Typelist< Head, Tail > >
		  {
			// recursive typedef to get matrix of required dimensions
			typedef typename Matrix< Tail >::Result 		InsideType;
			typedef typename Matrix< Tail >::ResultInt 		InsideTypeInt;
			typedef vector< InsideType > 				Result;
			typedef vector< InsideTypeInt > 			ResultInt;
			typedef typename vector< InsideType >::iterator 	ResultIterator;
			typedef typename vector< InsideTypeInt >::iterator 	ResultIteratorInt;
		  };
		
		// this template helps declaring iterators for each dimension of callBacks matrix
	private : template<class T > struct GetTail
		  {
			typedef Loki::NullType Result;
		  };

	private : template<class Head, class Tail>
		  struct GetTail< Loki::Typelist< Head , Tail > >
		  {
			typedef Tail Result;
		  };

	private : template<class Head >
		  struct GetTail< Loki::Typelist< Head , Loki::NullType > >
		  {
			typedef Loki::NullType Result;
		  };

	private : template <typename G, typename T, typename U>
		  struct Select
		  {
			typedef T Result;
		  };
	
	private : template <typename T, typename U>
		  struct Select<Loki::NullType, T, U>
		  {
			typedef U Result;
		  };

	private : typedef typename Loki::TL::Append<  Loki::NullType , BaseClass >::Result BaseClassList;
	private : typedef typename Loki::TL::TypeAtNonStrict<BaseClassList , 0>::Result	BaseClass1;  // 1D
	private : typedef typename Loki::TL::TypeAtNonStrict<BaseClassList , 1>::Result	BaseClass2;  // 2D
	private : typedef typename Loki::TL::TypeAtNonStrict<BaseClassList , 2>::Result	BaseClass3;  // 3D
		
	private : typedef typename GetTail< BaseClassList >::Result			Tail2; // 2D
	private : typedef typename GetTail< Tail2 >::Result				Tail3; // 3D
	private : typedef typename GetTail< Tail3 >::Result				Tail4; // 4D ...
		
	private : typedef typename Matrix< BaseClassList >::ResultIterator 		Iterator2; // outer iterator 2D
	private : typedef typename Matrix< Tail2 >::ResultIterator			Iterator3; // inner iterator 3D
	private : typedef typename Matrix< Tail3 >::ResultIterator			Iterator4; // more inner iterator 4D
		
	private : typedef typename Matrix< BaseClassList >::ResultIteratorInt		IteratorInfo2;
	private : typedef typename Matrix< Tail2 >::ResultIteratorInt			IteratorInfo3;
	private : typedef typename Matrix< Tail3 >::ResultIteratorInt			IteratorInfo4;
		
	private : typedef typename Matrix< BaseClassList >::Result MatrixType;
	private : typedef typename Matrix< BaseClassList >::ResultInt MatrixIntType;
	private : MatrixType callBacks;		// multidimensional matrix that stores functors ( 1D, 2D, 3D, 4D, ....)
	private : MatrixIntType callBacksInfo;	// multidimensional matrix for extra information about functors in the matrix
						// currently used to remember if it is reversed functor
						
	// ParmNReal is defined to avoid ambigious function call for different dimensions of multimethod
	private : typedef Loki::FunctorImpl<ResultType, TList > Impl;
	private : typedef TList ParmList;
	private : typedef Loki::NullType Parm1; 						// it's always at least 1D
	private : typedef typename Impl::Parm2 Parm2Real;
	private : typedef typename Select< Tail2 , Loki::NullType , Parm2Real >::Result Parm2; 	// 2D
	private : typedef typename Impl::Parm3 Parm3Real;
	private : typedef typename Select< Tail3 , Loki::NullType , Parm3Real >::Result Parm3; 	// 3D - to have 3D just working, without symmetry handling - change this line to be: typedef typename Impl::Parm3 Parm3;
	private : typedef typename Impl::Parm4 Parm4Real;
	private : typedef typename Select< Tail4 , Loki::NullType , Parm4Real >::Result Parm4;	// 4D - same as above
	private : typedef typename Impl::Parm5 Parm5;
	private : typedef typename Impl::Parm6 Parm6;
	private : typedef typename Impl::Parm7 Parm7;
	private : typedef typename Impl::Parm8 Parm8;
	private : typedef typename Impl::Parm9 Parm9;
	private : typedef typename Impl::Parm10 Parm10;
	private : typedef typename Impl::Parm11 Parm11;
	private : typedef typename Impl::Parm12 Parm12;
	private : typedef typename Impl::Parm13 Parm13;
	private : typedef typename Impl::Parm14 Parm14;
	private : typedef typename Impl::Parm15 Parm15;
	
	// Serialization stuff.. - FIXME - maybe this should be done in separate class...
//		bool deserializing;
// //	protected:
// // 		vector<vector<string> >	functorNames;
// // 		list<shared_ptr<Executor> > functorArguments;
// // 		typedef typename list<shared_ptr<Executor> >::iterator executorListIterator;
			
// 			virtual void registerAttributes()
